// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// System.Console.Write("Input a: ");
// int a = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Input b: ");
// int b = Convert.ToInt32(Console.ReadLine());

// if (a > b)
// {
//     System.Console.WriteLine($"a={a}, b={b} -> max = {a}, min = {b}");
// }
// else
// {
//     System.Console.WriteLine($"a={a}, b={b} -> max = {b}, min = {a}");
// }