// Задача 2: Напишите программу, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее.

// System.Console.Write("Input a: ");
// int a = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Input b: ");
// int b = Convert.ToInt32(Console.ReadLine());

// if (a > b)
// {
//     System.Console.WriteLine($"a={a}, b={b} -> max = {a}, min = {b}");
// }
// else
// {
//     System.Console.WriteLine($"a={a}, b={b} -> max = {b}, min = {a}");
// }




// Задача 4: Напишите программу, которая принимает на вход три числа и выдаёт максимальное из этих чисел

// System.Console.Write("Input a: ");
// int a = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Input b: ");
// int b = Convert.ToInt32(Console.ReadLine());
// System.Console.Write("Input c: ");
// int c = Convert.ToInt32(Console.ReadLine());

// int max = a;

// if (b > max) max = b;
// if (c > max) max = c;

// System.Console.WriteLine($"{a}, {b}, {c} -> {max}");




// Задача 6: Напишите программу, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка).

// System.Console.Write("Input number: ");
// int num = Convert.ToInt32(Console.ReadLine());

// if (num % 2 == 0)
// {
//     System.Console.WriteLine($"{num} -> yes");
// }
// else
// {
//     System.Console.WriteLine($"{num} -> no");
// }